tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Formula
brew "mas"
brew "starship"
brew "git"
brew "git-lfs"
brew "gh"
brew "tree"
brew "wget"
brew "google-cloud-sdk"
brew "asdf"
brew "uv"
brew "neovim" 
brew "tmux"
brew "neofetch"

# Cask
cask "font-hackgen"
cask "font-hackgen-nerd"

cask "google-chrome"
cask "firefox"
cask "raycast"
cask "alacritty"
cask "visual-studio-code"
cask "docker"
cask "slack"
cask "notion"
cask "discord"
cask "zoom"
cask "spotify"
cask "blender"
cask "obs"
cask "blackhole-2ch"
cask "thunderbird"
cask "postman"
cask "tableplus"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"

# MAS apps
mas "Magnet", id: 441258766
mas "Logic Pro", id: 634148309
mas "Day One", id: 1055511498
mas "Toggl Track", id: 1291898086
