tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Formula
brew "mas"
brew "starship"
brew "git"
brew "git-lfs"
brew "gh"
brew "tree"
brew "wget"
brew "google-cloud-sdk"
brew "asdf"
brew "uv"

# Cask
cask "google-chrome"
cask "firefox"
cask "arc"
cask "warp"
cask "slack"
cask "discord"
cask "zoom"
cask "spotify"
cask "notion"
cask "obsidian"
cask "raycast"
cask "blender"
cask "obs"
cask "blackhole-2ch"
cask "thunderbird"
cask "visual-studio-code"
cask "docker"
cask "postman"
cask "tableplus"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"

cask "font-hackgen"
cask "font-hackgen-nerd"

# MAS apps
mas 441258766, name: "Magnet"
mas 634148309, name: "Logic Pro"
mas 1055511498, name: "Day One"
mas 1291898086, name: "Toggl Track"
